/*
Условие задачи "О числах и арифметических операторах" :
Задача 2:
Что вернет следующий код?
*/
let number = 15;

let result = number + 5;

console.log(result);
/*
1) 10
2) 15
3) 20
4) 25
Выберите один ответ.  / можно просто нажать на нужную цифру-эмоджи или в комментариях ответить.
*/
/*
Верный ответ 3) 20.
15 + 5 = 20 (edited) 


let number = 15;
let result = number + 5;
console.log(result);
Что мы здесь видим:
ключевое (зарезервированное) слово let, с помощью которого создаются переменные number , result.
Если это let, то эти переменные могут изменяться, но это свойство в данном коде не используется.
переменной number присваивается значение 15.
Переменной result присваивается значение number + 5, это равносильно тому, что result = 15 + 5.
*/