/* 
У JavaScript нет пальцев на руках и ногах. Таким образом, ему не нужно соблюдать наши безумные человеческие правила о том, чтобы начинать отсчет с 1. Первый элемент массива JavaScript всегда имеет порядковый номер 0. 
*/

let zeroIndexedArray = [11, 22, 33, 44 ]

/*
Для вас это означает, что zeroIndexedArray[3] на самом деле является четвертым элементом массива.
*/

console.log(zeroIndexedArray[0]);
console.log(zeroIndexedArray[1]);
console.log(zeroIndexedArray[2]);
console.log(zeroIndexedArray[3]);
console.log(zeroIndexedArray[4]);
/*
Нумерация с отсчетом от нуля является частой причиной ошибок и путаницы у новичков в программировании, но как только вы к ней привыкнете, она станет вполне естественной. Вы даже можете обнаружить, что у этого есть свои преимущества, например, возможность повысить уровень гитарного усилителя до 11-го уровня.
*/
