/*
for ... in
для . . . в

Операторы for ... in циклически перебирают свойства объекта. Вы также можете использовать оператор for ... in для перебора значений массива.

Цикл for...in имеет интересную особенность (причуда). Ему не важен порядок свойств или элементов, через которые он проходит. По этой причине, а также потому, что использование цикла for ... in выполняется медленнее, гораздо лучше использовать стандартный цикл for для перебора элементов массива.


Объекты — это контейнеры данных, у которых есть свойства (что они собой представляют) и методы (что они делают). Веб-браузеры имеют набор встроенных объектов, которые программисты могут использовать для управления функциями браузера. Самым основным из них является объект Document. Например, метод записи объекта Document сообщает вашему браузеру о необходимости вставить указанное значение в документ HTML.

Объект Document также имеет свойства, которые он использует для отслеживания и предоставления программистам информации о текущем документе. Например, коллекция Document.images содержит все теги img в текущем HTML-документе.

Например, функция for . . . Цикл in используется для вывода списка всех свойств объекта Document.
*/

