/*
Задача 22. О стрелочных функциях JavaScript:
*/

// Пример стрелочной функции
const add = (a, b) => a + b;
console.log(add(2, 3)); // Выведет 5

/*
Вопрос: Что такое стрелочная функция в JavaScript?

Варианты ответов:
1. Стрелочная функция - это метод, который позволяет перемещаться по элементам массива.
2. Стрелочная функция - это способ определения функции в JavaScript с использованием стрелочного синтаксиса `=>`.
3. Стрелочная функция - это особый тип объекта в JavaScript, предназначенный для хранения и передачи функциональности.
4. Стрелочная функция - это ключевое слово в JavaScript, используемое для создания псевдонимов функций.
*/

/*
Такой тест поможет проверить понимание основных концепций и использования стрелочных функций в JavaScript.




Правильный ответ: 2. Стрелочная функция - это способ определения функции в JavaScript с использованием стрелочного синтаксиса `=>`.

Объяснение: Стрелочные функции - это новый синтаксис определения функций в JavaScript, введенный в ECMAScript 6. Они предоставляют более краткую и удобную запись функций по сравнению с обычными функциями. Стрелочная функция определяется с помощью стрелочного оператора `=>`, который заменяет ключевое слово `function`. Она имеет более короткий синтаксис и не имеет собственного контекста выполнения (`this`), который ссылается на окружающий контекст. Это делает стрелочные функции особенно удобными для использования в лямбда-выражениях или при работе с контекстом выполнения.
*/